app/views/users/_form.html.erb

SELECT `zones`.* FROM `zones` WHERE `zones`.`manager_id` = 29
---
  <label>Zones</label> <br>
  <%= form.collection_select(:zone_list, Zone.where(:manager_id => current_manager.id), :id, :name, options = {include_hidden: false, include_blank: "no zone" }, html_options = {multiple: "true",class: "dropdown"}) %>  <br/>