app/views/users/_form.html.erb

  <%= form.label :zone, style: "display: block" %>
  <%= form.collection_select(:zone, Zone.all, :id, :name, options = {include_hidden: false, include_blank: "no zone" }, html_options = {multiple: "true",class: "dropdown"}) %>  <br/>
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`user_id` = 11