app/views/users/index.html.erb

              <% @active_users.each do |station_log| %>
                <% if station_log.manager == current_manager && User.find_by(id: station_log.user_id)&.id == user.id %>
---
SELECT `managers`.* FROM `managers` WHERE `managers`.`id` = 29 ORDER BY `managers`.`id` ASC LIMIT 1