app/views/users/index.html.erb

SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 10 LIMIT 1
---
          <td><%  user.zone %>
		  <%= parseZones(user.zone).each do |zone|%>