app/helpers/userzones_helper.rb

SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`id` = 4 LIMIT 1
UPDATE `userzones` SET `userzones`.`pmk` = 'tHYOxIBx6C/aaRXfbqD3GyRwN4YGR66p5FSSArasLHw=\n', `userzones`.`updated_at` = '2023-07-07 17:35:55.853593' WHERE `userzones`.`id` = 4
---
	def genpmk(pass, ssid, userzoneid)

		#pass = pass
		#ssid = ssid
		salt = OpenSSL::Random.random_bytes(16)
		digest = OpenSSL::Digest::SHA256.new
		len = digest.digest_length
		key = OpenSSL::PKCS5.pbkdf2_hmac_sha1(pass, ssid, 4096, len)
		atype = key.class
		puts "Key (type:#{atype}, len:#{key.length}) #{key}"
		chars = key.split('')
		print "PMK Hex key: "
		chars.each do |n|
			print "#{n.ord.to_s(16)}"
		end
		puts " "

		pmkey = Base64.encode64(key).strip
		puts "PMK Text Key: #{pmkey}"

		userzone = Userzone.find_by(id: userzoneid)
		userzone.update(pmk: pmkey)