app/helpers/users_helper.rb

	def parseZones(user)
		s=""
		Userzone.where(:user_id => user.id).find_each do |uz|
			zoneID = uz.zone_id
			puts "HERE IT IS!!! #{zoneID}"
			zone = Zone.find_by(id: zoneID)
---
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`user_id` = 35 ORDER BY `userzones`.`id` ASC LIMIT 1000
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 12 LIMIT 1

	def userAddZone(user, user_params)
		puts "params: #{user_params}"
		zoneList = user_params[:zone_list]
		puts "zoneList: #{zoneList}"
		zoneList.each do |zoneID|
			zone = Zone.find_by(id: zoneID)
			userzone = Userzone.find_by(user_id: user, zone_id: zone)
			if !userzone
				userzone = Userzone.create(user_id: user.id, zone_id: zone.id, manager_id: current_manager.id)
				genpmk(user.passphrase, zone.ssid, userzone.id)
			end
		end

		Userzone.where(user_id: user).find_each do |uz|
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 12 LIMIT 1
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`user_id` = 45 AND `userzones`.`zone_id` = 45 LIMIT 1
INSERT INTO `userzones` (`zone_id`, `pmk`, `created_at`, `updated_at`, `manager_id`, `user_id`) VALUES (24, NULL, '2023-07-13 18:24:08.596156', '2023-07-13 18:24:08.596156', 29, 45)
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`user_id` = 47 ORDER BY `userzones`.`id` ASC LIMIT 1000