app/helpers/wificlients_helper.rb

	def parseWLAN(arr)
		require 'json'
		require 'erb'
		if arr == nil
			return
		end
		stringparse = arr
		b = JSON.parse(stringparse)
		s=""
		first = true
		b.each do |n|
			wlan = Wlan.find_by(:id => n).name
---
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`id` = 74 LIMIT 1

	def wificlientUpdate(wificlient, wificlient_params)
	puts "we are in"
	if (wificlient_params[:enabled] != wificlient.enabled and wificlient_params[:enabled]!=nil) or (wificlient_params[:wlan_name] != wificlient.wlan_name) or (wificlient_params[:country] != wificlient.country)
	wificlient.update(update_needed: true)
---
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-03 13:28:33.347072', `wificlients`.`update_needed` = TRUE WHERE `wificlients`.`id` = 76