app/helpers/wlans_helper.rb

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 76 LIMIT 1
---
  def parseWifiClient(arr)
		require 'erb'
		if arr == nil
			return
		end
		s=""
		client = Wificlient.find_by(:id => arr).name

SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 19 LIMIT 1
---
	def parseZone(arr)
		require 'erb'
		if arr == nil
			return
		end
		s=""
		zone = Zone.find_by(:id => arr).name

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 78 LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-12 20:12:33.360088', `wificlients`.`config_change` = TRUE WHERE `wificlients`.`id` = 78
---
	def wlanUpdate(wlan, wlan_params)
	  if !wlan.client_id.nil?
		if ((wlan_params[:enabled] != wlan.enabled and wlan_params[:enabled]!=nil) or (wlan_params[:mode] != wlan.mode and wlan_params[:mode]!=nil))
			puts "params: #{wlan_params[:enabled]} old: #{wlan.enabled}"
			puts "params: #{wlan_params[:mode]} old: #{wlan.mode}"
			puts "wlan id! #{wlan.id} client id! #{wlan.client_id}"
			client = Wificlient.find_by(id: wlan.client_id)
			client.update(config_change: true)