app/helpers/wlans_helper.rb

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`name` = 'jim' LIMIT 1
---
  def parseWifiClient(arr)
		require 'erb'
		if arr == nil
			return
		end
		s=""
		client = Wificlient.find_by(:name => arr).id

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 76 LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-12 20:22:49.275147', `wificlients`.`config_change` = TRUE WHERE `wificlients`.`id` = 78
---
	def wlanUpdate(wlan, wlan_params)

		if (wlan_params[:enabled] != wlan.enabled ) and wlan_params[:enabled]!=nil
			puts "params: #{wlan_params[:enabled]} old: #{wlan.enabled}"
			puts "wlan id! #{wlan.id} client id! #{wlan.client_id}"
			client = Wificlient.find_by(id: wlan.client_id)
			client.update(update_needed: true)