app/helpers/zones_helper.rb

  def zoneUpdate(zone, zone_params)
		if (zone_params[:ssid] != zone.ssid and zone_params[:ssid] != nil)
			puts "NEW SSID #{zone_params[:ssid]} OLD SSID #{zone.ssid}"

			(Userzone.where(:zone_id => zone.id)).find_each do |us|
				user = User.find_by(id: us.user_id)
				genpmk(user.passphrase, zone_params[:ssid], us.id)
			end

			Wlan.where( :zone => zone).find_each do |wlan|
					puts "checkpoint 2!"
					client = Wificlient.find_by(id: wlan.client_id)
					client.update(pmk_change: true)
					puts "client ID! : #{client.id}"
				end

			puts "update needed!"
		else
			puts "update not needed"
		end

		if  (zone_params[:open_ap] != zone.open_ap and zone_params[:open_ap] != nil)
			Wlan.where( :zone => zone).find_each do |wlan|
					puts "checkpoint 2!"
					client = Wificlient.find_by(id: wlan.client_id)
---
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`zone_id` = 19 ORDER BY `userzones`.`id` ASC LIMIT 1000
SELECT `users`.* FROM `users` WHERE `users`.`id` = 42 LIMIT 1
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`zone` = '19' ORDER BY `wlans`.`id` ASC LIMIT 1000
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 78 LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-12 20:04:35.945197', `wificlients`.`pmk_change` = TRUE WHERE `wificlients`.`id` = 78
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`zone` = '12' ORDER BY `wlans`.`id` ASC LIMIT 1000
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 76 LIMIT 1