app/views/station_logs/index.html.erb

SELECT `managers`.* FROM `managers` WHERE `managers`.`id` = 29 ORDER BY `managers`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 47 LIMIT 1
---
   <tbody>
      <% @active_users.each do |station_log| %> <% if station_log.manager == current_manager%>
      <tr>
		 <td><%= User.find_by(id: station_log.user_id)&.name || 'Unknown' %></td>

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:a8:7d:92' LIMIT 1
---
         <td>
            <%= link_to Wificlient.find_by(mac: station_log.ap_mac).name, wificlient_path(Wificlient.find_by(mac: station_log.ap_mac)), style: "text-decoration:none" %>