app/controllers/api/v1/wificlients.rb

UPDATE `wlans` SET `wlans`.`lastseen` = '2023-06-12 18:56:19.568869', `wlans`.`updated_at` = '2023-06-12 18:56:19.569677' WHERE `wlans`.`id` = 31
---
def process_hello(params)
  client = Wificlient.find_by(mac: params[:mac])
  if client
    client.update(lastseen: Time.new)
    if client.ipaddress != params[:ipaddress] or client.version != params[:version] or client.os != params[:os] or client.model != params[:model]
      client.update(status: "Turned On", ipaddress: params[:ipaddress], version: params[:version], os: params[:os], model: params[:model])
    end
  else
    client = Wificlient.create(mac: params[:mac], status: "Turned On", os: params[:os], version: params[:version], serial: params[:serial], model: params[:model], lastseen: Time.new, dateadded: Time.new)
  end

  wlans = params[:wlans]
  a = []
  wlans.each do |wlan|
    thiswlan = Wlan.find_by(mac: wlan["mac"])
    a.push(wlan["mac"])

SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 64 ORDER BY `wlans`.`id` ASC LIMIT 1000
---
      Wlan.create(mac: wlan["mac"], wlan: wlan["wlan"], phy: wlan["phy"], txpower: wlan["txpower"], g: wlan["band1"]["channels"], client_id: client.id, lastseen: Time.new, selected_g: wlan["band1"]["channels"], dateadded: Time.new, name: wlan["wlan"], mode: "G", manager_id: client.manager_id)
    end

    Wlan.where(client_id: client.id).find_each do |wlan|

UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-12 19:57:34.010336', `wificlients`.`wlan_name` = '[85]' WHERE `wificlients`.`id` = 78
---
def process_config(params)
  puts "PROCESSING CONFIG"
  client = Wificlient.find_by(mac: params[:mac])

  if client.enabled
    client.update(status: "Config")

UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-11 19:22:55.845345', `wificlients`.`config_change` = FALSE, `wificlients`.`pmk_change` = FALSE WHERE `wificlients`.`id` = 76
---
def alive(params)
  client = Wificlient.find_by(mac: params[:mac])
  channels = params[:channels]

  # Gets the current config for the given client.
  config = make_config(client)

  # Computes the digest of the current config.
  config_digest = Digest::MD5.hexdigest(config.to_s)

  channels.each do |wlans|
    wlan = Wlan.where(client_id: client.id, wlan: wlans[0])
    wlan.update(channel: wlans[1])
  end
  wlanEnabled = false
  if !client.nil?
    Wlan.where(client_id: client.id).find_each do |wlan|
      if wlan.enabled
        wlanEnabled = true
        wlan.update(status: "Run-Enabled")

      end
    end
  end

  if !client.enabled
    client.update(status: "Alive-Disabled")
  elsif client.lastseen <= 10.minutes.ago(Time.now)
    client.update(status: "No contact")

SELECT `users`.* FROM `users` WHERE `users`.`id` = 47 LIMIT 1
---
def make_config(client)
  # Initializes an empty hash to store the config.
  config = {}

  # An array of hashes that represent each pmk and user ID.
  puts "############################# #{client.name}"
  pmk = Wlan.where(client_id: client.id)
    .find_each
    .map { |wlan| wlan.zone }
    .flat_map do |zone_id|
      Userzone.where(zone_id: zone_id)
        .find_each
        .map { |uz| {pmk: uz.pmk, user_id: uz.user_id, maxdev: User.find(uz.user_id).maxdev, upmax: User.find(uz.user_id).upmax, downmax: User.find(uz.user_id).downmax } }
    end
  puts "%%%%%%%%%%%%%%%%%%%%%%%%% #{pmk}"
  # An array of hashes that represent a WLAN and its config.
  radios = Wlan.where(client_id: client.id)
    .find_each
    .map do |wlan|
      if wlan.enabled
        zone = Zone.find_by(id: wlan.zone)
        wlan_channels = (wlan.mode == "A") ? wlan.selected_a : wlan.selected_g
        hostapd_hash = {
          ssid: zone.ssid,
          interface: wlan.wlan,
          channel: JSON.parse(wlan_channels).first,
          hw_mode: wlan.mode,
          open: zone.open_ap,
          channel_list: wlan_channels