app/controllers/api/v1/wificlients.rb

		    puts "Hello! This is the API"
		    mac = params[:mac]
			puts "MAC address: #{mac}"
			client = Wificlient.find_by(mac:mac)
---
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:a8:7d:92' LIMIT 1

def process_hello(params)
	client = Wificlient.find_by(mac:params[:mac])
	if client
		client.update(lastseen: Time.new)
		if client.ipaddress != params[:ipaddress] or client.version != params[:version] or client.os != params[:os] or client.model != params[:model]
			client.update(ipaddress:  params[:ipaddress], version:  params[:version], os: params[:os], model: params[:model])
		end
	else
		client = Wificlient.create(mac:params[:mac],os:params[:os],version:params[:version],serial:params[:serial],model:params[:model], lastseen: Time.new, dateadded:Time.new, pmk_change: false, config_change: false)
	end

	wlans = params[:wlans] # we gat params from JSON
	a = Array.new
	w = Array.new
	wlans.each do |wlan|
		thiswlan = Wlan.find_by(mac:wlan['mac'])
		a.push(wlan['mac'])
		wlang = wlan["band1"]["channels"]
		band2 = wlan["band2"]
		if thiswlan
			thiswlan.update(lastseen: Time.new)
			if !band2.nil?
				if thiswlan.wlan != wlan["wlan"] or thiswlan.phy != wlan["phy"] or thiswlan.txpower != wlan["txpower"] or thiswlan.g != wlan["band1"]["channels"] or thiswlan.a != wlan["band2"]["channels"] or thiswlan.client_id != client.id
					thiswlan.update(wlan: wlan["wlan"], phy: wlan["phy"], txpower: wlan["txpower"] , g: wlan["band1"]["channels"], a: wlan["band2"]["channels"], client_id: client.id)
				end
			else
				if thiswlan.wlan != wlan["wlan"] or thiswlan.phy != wlan["phy"] or thiswlan.txpower != wlan["txpower"] or thiswlan.g != wlan["band1"]["channels"] or thiswlan.client_id != client.id
					thiswlan.update(wlan: wlan["wlan"], phy: wlan["phy"], txpower: wlan["txpower"] , g: wlan["band1"]["channels"], client_id: client.id)
---
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:a8:7d:92' LIMIT 1
UPDATE `wificlients` SET `wificlients`.`lastseen` = '2023-07-12 19:57:34.168333', `wificlients`.`updated_at` = '2023-07-12 19:57:34.168692' WHERE `wificlients`.`id` = 78
INSERT INTO `wificlients` (`location`, `ipaddress`, `version`, `os`, `model`, `status`, `pollrate`, `lastseen`, `note`, `name`, `dateadded`, `confighash`, `enabled`, `created_at`, `updated_at`, `mac`, `serial`, `manager_id`, `country`, `wlan_name`, `config_change`, `pmk_change`) VALUES (NULL, NULL, '1.0.9', '6.1.21-v8+', 'Raspberry Pi 4 Model B Rev 1.2', NULL, NULL, '2023-07-12 19:57:33.995563', NULL, NULL, '2023-07-12 19:57:33.995564', NULL, NULL, '2023-07-12 19:57:33.995881', '2023-07-12 19:57:33.995881', 'dc:a6:32:a8:7d:92', '10000000fd0eff79', NULL, NULL, NULL, FALSE, FALSE)
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 59 LIMIT 1
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`mac` = '94:18:65:77:ac:b7' LIMIT 1
INSERT INTO `wlans` (`mac`, `name`, `description`, `status`, `wlan`, `phy`, `txpower`, `a`, `g`, `lastseen`, `dateadded`, `channel`, `client_id`, `created_at`, `updated_at`, `selected_a`, `selected_g`, `manager_id`) VALUES ('dc:a6:32:ab:0e:9c', NULL, NULL, NULL, 'wlan0', 'phy0', '20.00', '[\"36\", \"40\", \"44\", \"48\", \"149\", \"153\", \"157\", \"161\", \"165\"]', '[\"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"10\", \"11\"]', '2023-06-20 13:34:38.858046', '2023-06-20 13:34:38.858056', NULL, 57, '2023-06-20 13:34:38.858364', '2023-06-20 13:34:38.858364', '[\"36\", \"40\", \"44\", \"48\", \"149\", \"153\", \"157\", \"161\", \"165\"]', '[\"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"10\", \"11\"]', NULL)
UPDATE `wlans` SET `wlans`.`txpower` = '15.00 dBm', `wlans`.`updated_at` = '2023-06-09 17:14:49.437983' WHERE `wlans`.`id` = 18
UPDATE `wlans` SET `wlans`.`lastseen` = '2023-07-12 19:57:34.177633', `wlans`.`updated_at` = '2023-07-12 19:57:34.177982' WHERE `wlans`.`id` = 85
UPDATE `wlans` SET `wlans`.`a` = '[\"34\", \"36\", \"38\", \"40\", \"42\", \"44\", \"46\", \"48\", \"149\", \"153\", \"157\", \"161\", \"165\"]', `wlans`.`client_id` = 78, `wlans`.`updated_at` = '2023-07-12 20:05:34.691787' WHERE `wlans`.`id` = 88

			if !band2.nil?
				Wlan.create(mac: wlan["mac"],wlan:wlan["wlan"],phy:wlan["phy"],txpower:wlan["txpower"],g:wlan["band1"]["channels"], a:wlan["band2"]["channels"],client_id: client.id, lastseen: Time.new, selected_g:wlan["band1"]["channels"], selected_a:wlan["band2"]["channels"], dateadded:Time.new, name:wlan["wlan"], mode:"G")
			else
				Wlan.create(mac: wlan["mac"],wlan:wlan["wlan"],phy:wlan["phy"],txpower:wlan["txpower"],g:wlan["band1"]["channels"],client_id: client.id, lastseen: Time.new, selected_g:wlan["band1"]["channels"],  dateadded:Time.new, name:wlan["wlan"], mode:"G")
			end
		end

		Wlan.where(:client_id => client.id).find_each do |wlan|
---
INSERT INTO `wlans` (`mac`, `name`, `description`, `status`, `wlan`, `phy`, `txpower`, `a`, `g`, `lastseen`, `dateadded`, `channel`, `client_id`, `created_at`, `updated_at`, `selected_a`, `selected_g`, `manager_id`, `client_name`, `enabled`, `zone`, `mode`) VALUES ('94:18:65:77:ac:b7', 'wlan3', NULL, NULL, 'wlan3', 'phy1', '18.00', '[]', '[\"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"10\", \"11\"]', '2023-07-12 19:57:34.003386', '2023-07-12 19:57:34.003400', NULL, 78, '2023-07-12 19:57:34.003687', '2023-07-12 19:57:34.003687', '[]', '[\"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"10\", \"11\"]', NULL, NULL, NULL, NULL, 'G')
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 78 ORDER BY `wlans`.`id` ASC LIMIT 1000

				wlan.update(client_id: nil)
			end
			if !w.include?(wlan.id)
			w.push(wlan.id)
			end
		end
	client.update(wlan_name: w)
---
UPDATE `wlans` SET `wlans`.`client_id` = NULL, `wlans`.`updated_at` = '2023-07-12 19:57:34.185422' WHERE `wlans`.`id` = 86
UPDATE `wlans` SET `wlans`.`client_id` = NULL, `wlans`.`updated_at` = '2023-07-14 17:17:28.655478' WHERE `wlans`.`id` = 96

def process_config(params)
	client = Wificlient.find_by(mac:params[:mac])
	start = params[:start]
	zone_array = []

	radios = Array.new
	#The Status of the Wificlient

	if client.enabled
		Wlan.where(client_id: client.id).find_each do |wlan|
			zone_array.append(wlan.zone)
			wlan_hash = {}
			zone = Zone.find_by(id: wlan.zone)
			puts "BEFORE WLAN"
			if wlan.enabled
				puts "BREAK IN SUCCESS"
				hostapd_hash = {}
				if wlan.mode == "A"
					channels = wlan.selected_a
				else
					channels = wlan.selected_g
				end
				hostapd_hash.merge!({ "ssid": zone.ssid, "interface": wlan.wlan, "channel": JSON.parse(channels).first, "hw_mode": wlan.mode, "open": zone.open_ap, "channel_list": parseArray(channels) })
---
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:ab:0e:9b' LIMIT 1
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 76 ORDER BY `wlans`.`id` ASC LIMIT 1000
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` IS NULL LIMIT 1
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 12 LIMIT 1


		pmk = Array.new
		zone_array.each do |zoneID|
			Zone.find_by(id: zoneID)
			Userzone.where(zone_id: zoneID).find_each do |uz|
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 12 LIMIT 1
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`zone_id` = 12 ORDER BY `userzones`.`id` ASC LIMIT 1000

def alive(params)
	client = Wificlient.find_by(mac:params[:mac])
	wlanEnabled = false

	if client != nil

		Wlan.where(client_id: client.id).find_each do |wlan|
---
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:ab:0e:9b' LIMIT 1
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 78 ORDER BY `wlans`.`id` ASC LIMIT 1000