app/controllers/api/v1/wificlients.rb

def update_wireless_clients(params)
	apMac = params['AP']

	stations = params['Stations']
	stations.each do |station|
		stationParams = station[1]
		mac = station[0]

		stationTest = StationLog.create(ap_mac: apMac, mac: mac.downcase, interface: stationParams['interface'],channel: stationParams['channel'], rx_bytes: stationParams['rx bytes'], tx_bytes: stationParams['tx bytes'], tx_retries: stationParams['tx retries'],tx_failed: stationParams['tx failed'],
							signal: stationParams['signal'], signal_avg: stationParams['signal avg'], tx_bitrate: stationParams['tx bitrate'], rx_bitrate: stationParams['rx bitrate'], expected_throughput: stationParams['expected throughput'], associated: stationParams['associated'], vid: stationParams['vid'], ssid: stationParams['ssid'],
							user_id: stationParams['user_id'], event: stationParams['event'], connected_time: stationParams['connected time'])
---
INSERT INTO `station_logs` (`AP`, `station`, `interface`, `channel`, `rx_bytes`, `tx_bytes`, `tx_retries`, `tx_failed`, `signal`, `signal_avg`, `tx_bitrate`, `rx_bitrate`, `expected_throughput`, `associated`, `vid`, `ssid`, `user_id`, `event`, `mac`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2023-07-11 20:27:36.530817', '2023-07-11 20:27:36.530817')