app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`
---
  def index
    @accounts = Account.all

INSERT INTO `accounts` (`first_name`, `last_name`, `email`, `phone`, `address1`, `address2`, `city`, `state`, `zip`, `accounttype`, `created_at`, `updated_at`, `admin`) VALUES ('Irina', 'Beshentseva', 'beshentseva2@kenyon.edu', '', '106 College Park Dr.', '', 'Gambier', 'Ohio', '43022', 'Student', '2023-06-02 13:34:57.420353', '2023-06-02 13:34:57.420353', NULL)
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

DELETE FROM `accounts` WHERE `accounts`.`id` = 1
---
  def destroy
    @account.destroy

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
---
    def set_account
      @account = Account.find(params[:id])