app/controllers/jsontests_controller.rb

SELECT `jsontests`.* FROM `jsontests`
---
  def index
    @jsontests = Jsontest.all