app/controllers/owners_controller.rb

SELECT `owners`.* FROM `owners`
---
  def index
    @owners = Owner.all

INSERT INTO `owners` (`first_name`, `last_name`, `email`, `phone`, `address1`, `address2`, `city`, `state`, `zip`, `ownertype`, `created_at`, `updated_at`) VALUES ('Doug', 'Karl', 'doug@dougkarl.com', '614-571-5701', 'clpperway', '', 'Columbus', 'Ohio', '43221', 'CPU Freak', '2023-06-01 18:50:06.606057', '2023-06-01 18:50:06.606057')
---
  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save

SELECT `owners`.* FROM `owners` WHERE `owners`.`id` = 21 LIMIT 1
---
    def set_owner
      @owner = Owner.find(params[:id])