app/controllers/station_logs_controller.rb

SELECT `station_logs`.* FROM `station_logs` WHERE `station_logs`.`id` IN (380, 407, 602, 522, 626, 601, 606, 625, 401)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 47 LIMIT 1
---
  def index
    #@station_logs = StationLog.all
	puts "NEW SORT ATTEMPTED WEE WOO WEE WOO ENTERING INDEX"
	stationList_array = StationLog.find_by_sql('select * from station_logs t inner join ( select mac, max(created_at) as MaxDate from station_logs where user_id IS NOT NULL group by mac ) tm on t.mac = tm.mac and t.created_at = tm.MaxDate;')
	stationList = StationLog.where(id: stationList_array.map(&:id))
	#puts "sort username!: #{sort_order_username}"

	#puts "sort rx_bytes!: #{sort_order_rx_bytes}"

    if params[:sort] == "Username_asc"
	  sort_order_username = cookies[:sort_order_username] || 'asc'
	  if sort_order_username == 'asc'
			cookies[:sort_order_username] = sort_order_username == 'asc' ? 'desc' : 'asc'
	  end
	  @station_logs = stationList.sort_by{|station_log| User.find_by(id: station_log.user_id).name}