app/controllers/users_controller.rb

  def create
    #@user = User.new(user_params)
    @user = current_manager.users.build(user_params.except(:zone_list))

	(user_params[:zone_list]).each do |zone|
		puts "checkpoint! #{zone}"
		Wlan.where( :zone => zone).find_each do |wlan|
		puts "checkpoint 2!"
			client = Wificlient.find_by(id: wlan.client_id)
			client.update(pmk_change: true)
			puts "client ID! : #{client.id}"
		end
	end


	#client.update(update_needed: true)
    respond_to do |format|
      if @user.save
---
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`zone` = '12' ORDER BY `wlans`.`id` ASC LIMIT 1000
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 76 LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-10 16:47:07.814624', `wificlients`.`pmk_change` = TRUE WHERE `wificlients`.`id` = 76
INSERT INTO `users` (`name`, `user_type`, `passphrase`, `manager_id`, `zone`, `created_at`, `updated_at`, `zone_id`, `client_id`, `vlan_id`) VALUES ('Iirna', 's/fbke', '123456778', 29, NULL, '2023-07-07 17:35:55.832334', '2023-07-07 17:35:55.832334', NULL, NULL, 0)

  def update
	userUpdate(@user, user_params)
    respond_to do |format|
      if @user.update(user_params.except(:zone_list))
---
UPDATE `users` SET `users`.`name` = 'Michelle', `users`.`updated_at` = '2023-06-21 15:30:38.339180' WHERE `users`.`id` = 12

  def destroy
	(Userzone.where(:user_id => @user.id)).find_each do |user|


		zone = user.zone_id
		Wlan.where( :zone => zone).find_each do |wlan|
			puts "checkpoint 2!"
			client = Wificlient.find_by(id: wlan.client_id)
			client.update(pmk_change: true)
			puts "client ID! : #{client.id}"
		end

	  user.destroy
	end




	@user.destroy
---
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`user_id` = 28 ORDER BY `userzones`.`id` ASC LIMIT 1000
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`zone` = '10' ORDER BY `wlans`.`id` ASC LIMIT 1000
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` IS NULL LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-13 15:50:40.100321', `wificlients`.`pmk_change` = TRUE WHERE `wificlients`.`id` = 78
DELETE FROM `users` WHERE `users`.`id` = 2
DELETE FROM `userzones` WHERE `userzones`.`id` = 3
DELETE FROM `userzones` WHERE `userzones`.`id` = 14
DELETE FROM `users` WHERE `users`.`id` = 28