app/controllers/users_controller.rb

  def create
    #@user = User.new(user_params)
    @user = current_manager.users.build(user_params)

	zone = Zone.find_by(id: @user.zone_id)
	puts "LOOOOOKK"
	puts "#{zone}"
	#client.update(update_needed: true)
    respond_to do |format|
      if @user.save
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` IS NULL LIMIT 1
INSERT INTO `userzones` (`zone_id`, `pmk`, `created_at`, `updated_at`, `manager_id`, `user_id`) VALUES (12, NULL, '2023-07-07 17:35:55.839291', '2023-07-07 17:35:55.839291', NULL, 35)
UPDATE `userzones` SET `userzones`.`pmk` = 'tHYOxIBx6C/aaRXfbqD3GyRwN4YGR66p5FSSArasLHw=\n', `userzones`.`updated_at` = '2023-07-07 17:35:55.853593' WHERE `userzones`.`id` = 4
INSERT INTO `users` (`name`, `user_type`, `passphrase`, `manager_id`, `zone`, `created_at`, `updated_at`, `zone_id`) VALUES ('', '', '', 29, '', '2023-06-21 15:30:31.524285', '2023-06-21 15:30:31.524285', NULL)
UPDATE `users` SET `users`.`zone` = '', `users`.`updated_at` = '2023-06-21 14:07:22.034014' WHERE `users`.`id` = 1