app/controllers/userzones_controller.rb

  def index
    @userzones = Userzone.all
---
SELECT `userzones`.* FROM `userzones`

  def create
    #@userzone = Userzone.new(userzone_params)
    @userzone = current_manager.userzones.build(userzone_params)

    respond_to do |format|
      if @userzone.save
---
INSERT INTO `userzones` (`zone_id`, `user_id`, `pmk`, `created_at`, `updated_at`) VALUES (2, 2, 'vdw;sdvuw', '2023-06-21 19:30:17.898127', '2023-06-21 19:30:17.898127')

  def destroy
    @userzone.destroy
---
DELETE FROM `userzones` WHERE `userzones`.`id` = 6

    def set_userzone
      @userzone = Userzone.find(params[:id])
---
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`id` = 6 LIMIT 1