app/controllers/wificlients_controller.rb

SELECT `wificlients`.* FROM `wificlients`
---
  def index
    @wificlients = Wificlient.all

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`mac` = 'dc:a6:32:ab:0e:93' LIMIT 1
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`name` = 'Irina' LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-06-19 19:30:32.275285', `wificlients`.`manager_id` = 24 WHERE `wificlients`.`id` = 52
UPDATE `wificlients` SET `wificlients`.`name` = 'Irina', `wificlients`.`updated_at` = '2023-07-12 19:57:57.063314' WHERE `wificlients`.`id` = 78
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 78 ORDER BY `wlans`.`id` ASC LIMIT 1000
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-12 19:57:57.067614', `wificlients`.`manager_id` = 29 WHERE `wificlients`.`id` = 78
UPDATE `wlans` SET `wlans`.`updated_at` = '2023-07-12 19:57:57.074622', `wlans`.`manager_id` = 29, `wlans`.`client_name` = 'Irina' WHERE `wlans`.`id` = 85
---
  def create
    #@wificlient = Wificlient.new(wificlient_params)
	#@wificlient = current_manager.wificlients.build(wificlient_params)
	client = Wificlient.find_by(mac:wificlient_params[:mac])
	check = false
	if client && client.manager_id.nil?
		check = true
	end

	unique = false
	if !Wificlient.find_by(name:wificlient_params[:name]) && check
	unique = true
	client.update(name: wificlient_params[:name])
	client.update(manager_id: current_manager.id)
	Wlan.where(:client_id => client.id).find_each do |wlan|
	wlan.update(manager_id: current_manager.id, client_name:client.name)

UPDATE `wificlients` SET `wificlients`.`enabled` = FALSE, `wificlients`.`updated_at` = '2023-06-30 17:22:09.080542' WHERE `wificlients`.`id` = 75
---
  def update
    respond_to do |format|
      if @wificlient.update(wificlient_params)

DELETE FROM `wificlients` WHERE `wificlients`.`id` = 76
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`client_id` = 76 ORDER BY `wlans`.`id` ASC LIMIT 1000
UPDATE `wlans` SET `wlans`.`client_id` = NULL, `wlans`.`updated_at` = '2023-07-13 15:54:58.655029' WHERE `wlans`.`id` = 89
---
  def destroy
	#grab client_id prior to deleting
	idReset = @wificlient.id
    @wificlient.destroy

	#set associated wlans to null
	Wlan.where( :client_id => idReset).find_each do |wlan|
		wlan.update(client_id: nil)

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 75 LIMIT 1
---
    def set_wificlient
      @wificlient = Wificlient.find(params[:id])