app/controllers/wificlients_controller.rb

  def create
    #@wificlient = Wificlient.new(wificlient_params)
	@wificlient = current_manager.wificlients.build(wificlient_params)

    respond_to do |format|
      if @wificlient.save
---
INSERT INTO `wificlients` (`location`, `ipaddress`, `version`, `os`, `model`, `status`, `pollrate`, `lastseen`, `note`, `name`, `dateadded`, `confighash`, `enabled`, `created_at`, `updated_at`, `mac`, `serial`, `manager_id`) VALUES ('q\'oesfb', 'lq\'ebf\'qiebiqehfb\\', NULL, NULL, NULL, '', NULL, NULL, '', '', NULL, '', NULL, '2023-06-19 18:40:55.879207', '2023-06-19 18:40:55.879207', NULL, NULL, 24)

  def destroy
	#grab client_id prior to deleting
	idReset = @wificlient.id
    @wificlient.destroy

	#set associated wlans to null
	Wlan.find_each do |wlan|
---
SELECT `wlans`.* FROM `wlans` ORDER BY `wlans`.`id` ASC LIMIT 1000

    def set_wificlient
      @wificlient = Wificlient.find(params[:id])
---
SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` = 49 LIMIT 1