app/controllers/wlans_controller.rb

SELECT `wlans`.* FROM `wlans`
---
  def index
    @wlans = Wlan.all

UPDATE `wlans` SET `wlans`.`description` = '', `wlans`.`updated_at` = '2023-07-12 20:00:04.163760', `wlans`.`zone` = '19' WHERE `wlans`.`id` = 88
---
  def update

	wlanUpdate(@wlan, wlan_params)

    respond_to do |format|
      if @wlan.update(wlan_params)

SELECT `wificlients`.* FROM `wificlients` WHERE `wificlients`.`id` IS NULL LIMIT 1
UPDATE `wificlients` SET `wificlients`.`updated_at` = '2023-07-13 15:54:40.315066', `wificlients`.`config_change` = TRUE WHERE `wificlients`.`id` = 78
DELETE FROM `wlans` WHERE `wlans`.`id` = 84
---
  def destroy
	client = Wificlient.find_by(id: @wlan.client_id)
	if client
		client.update(config_change: true)
		puts "client ID! : #{client.id}"
	end

    @wlan.destroy

SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`id` = 84 LIMIT 1
---
    def set_wlan
      @wlan = Wlan.find(params[:id])