app/controllers/wlanclients_controller.rb

  def index
    @wlanclients = Wlanclient.all
---
SELECT `wlanclients`.* FROM `wlanclients`

  def create
    @wlanclient = Wlanclient.new(wlanclient_params)

    respond_to do |format|
      if @wlanclient.save
---
INSERT INTO `wlanclients` (`location`, `ipaddress`, `clientversion`, `osversion`, `hwmodel`, `status`, `pollrate`, `lastseen`, `note`, `name`, `dateadded`, `confighash`, `ownerid`, `created_at`, `updated_at`, `enabled`) VALUES ('somewhere', 'soekrpoeksoprk', 'pwokewk', 'keoprkoewkr', 'pokeoprkwoe', 'opkeropkweoprk', 0, '2023-06-14 01:16:00', 'note', 'powefmv;xl;sdfs', '2023-06-28 03:16:00', '[pwep[rk[we;r', 0, '2023-06-05 15:16:26.760792', '2023-06-05 15:16:26.760792', NULL)

  def destroy
    @wlanclient.destroy
---
DELETE FROM `wlanclients` WHERE `wlanclients`.`id` = 2

    def set_wlanclient
      @wlanclient = Wlanclient.find(params[:id])
---
SELECT `wlanclients`.* FROM `wlanclients` WHERE `wlanclients`.`id` = 1 LIMIT 1