app/controllers/zones_controller.rb

  def index
    @zones = Zone.all
---
SELECT `zones`.* FROM `zones`

  def create
    #@zone = Zone.new(zone_params)
	@zone = current_manager.zones.build(zone_params)
    respond_to do |format|
      if @zone.save
---
INSERT INTO `zones` (`name`, `description`, `ssid`, `open_ap`, `manager_id`, `created_at`, `updated_at`) VALUES ('irna', 'sd\'qw', 'ws/q', NULL, 29, '2023-07-03 14:04:27.056594', '2023-07-03 14:04:27.056594')

  def update
  zoneUpdate(@zone, zone_params)
    respond_to do |format|
      if @zone.update(zone_params)
---
UPDATE `zones` SET `zones`.`ssid` = 'IrinaWifi', `zones`.`updated_at` = '2023-07-12 20:04:35.952004' WHERE `zones`.`id` = 19

  def destroy
	(Userzone.where(:zone_id => @zone.id)).find_each do |zone|
	  zone.destroy
	end

	Wlan.where(zone: @zone.id).find_each do |wlan|
			puts "checkpoint!"
			wlan.update(zone: nil)
		end

    @zone.destroy
---
SELECT `userzones`.* FROM `userzones` WHERE `userzones`.`zone_id` = 13 ORDER BY `userzones`.`id` ASC LIMIT 1000
DELETE FROM `zones` WHERE `zones`.`id` = 10
DELETE FROM `userzones` WHERE `userzones`.`id` = 5
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 1 LIMIT 1
SELECT `wlans`.* FROM `wlans` WHERE `wlans`.`zone` = '14' ORDER BY `wlans`.`id` ASC LIMIT 1000
UPDATE `wlans` SET `wlans`.`updated_at` = '2023-07-07 19:08:46.101736', `wlans`.`zone` = NULL WHERE `wlans`.`id` = 76
DELETE FROM `zones` WHERE `zones`.`id` = 14

    def set_zone
      @zone = Zone.find(params[:id])
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 14 LIMIT 1